In [1]:
import pandas as pd

In [2]:
# Import the dataframe
df = pd.read_csv("data/Titanic-Dataset.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe().round(2)

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [ ]:
# univariate analysis
# bivariate analysis

In [9]:
# Survived Stats
survived = df['Survived'].value_counts().to_frame().reset_index()
survived['Percentage'] = (survived['count']/survived['count'].sum()) * 100.0
survived

   Survived  count  Percentage
0         0    549   61.616162
1         1    342   38.383838

In [10]:
# replacing the values of 0 and 1 in Survived
df['Survived'] = df['Survived'].replace([0, 1], ['No', 'Yes'])

In [12]:
df['Survived'].value_counts().to_frame().reset_index()

  Survived  count
0       No    549
1      Yes    342

In [14]:
df['Pclass'].value_counts().to_frame().reset_index()

   Pclass  count
0       3    491
1       1    216
2       2    184

In [16]:
df['Sex'].value_counts().to_frame().reset_index()

      Sex  count
0    male    577
1  female    314

In [18]:
df[['Sex', 'Survived']].value_counts().to_frame().reset_index().sort_values(by='Sex')

      Sex Survived  count
1  female      Yes    233
3  female       No     81
0    male       No    468
2    male      Yes    109

In [31]:
df['Age'].agg(['min', 'max', 'mean', 'median']).to_frame().reset_index().round(2)

    index    Age
0     min   0.42
1     max  80.00
2    mean  29.70
3  median  28.00

In [32]:
0 - 5 -> Infant
6 - 12 -> Child
13 - 19 -> Teen
20 - 30 -> Baby Adult
31 - 50 -> Adult
51 - 80 -> Old

5.04

In [36]:
conditions = [
    (df['Age'] >= 0) & (df['Age'] <= 5),
    (df['Age'] >= 6) & (df['Age'] <= 12),
    (df['Age'] >= 13) & (df['Age'] <= 19),
    (df['Age'] >= 20) & (df['Age'] <= 30),
    (df['Age'] >= 31) & (df['Age'] <= 50),
    (df['Age'] >= 51) & (df['Age'] <= 80)
]

mappings = ['Infant', 'Child', 'Teen', 'BabyAdult', 'Adult', 'Old']

In [38]:
import numpy as np
df['AgeGroup'] = np.select(conditions, mappings, default='Unknown')

In [39]:
df[['Age', 'AgeGroup']]

      Age   AgeGroup
0    22.0  BabyAdult
1    38.0      Adult
2    26.0  BabyAdult
3    35.0      Adult
4    35.0      Adult
..    ...        ...
886  27.0  BabyAdult
887  19.0       Teen
888   NaN    Unknown
889  26.0  BabyAdult
890  32.0      Adult

[891 rows x 2 columns]

In [40]:
df[['AgeGroup', 'Survived']].value_counts().to_frame().reset_index().sort_values(by='AgeGroup')

     AgeGroup Survived  count
1       Adult       No    137
3       Adult      Yes    102
0   BabyAdult       No    158
4   BabyAdult      Yes     87
11      Child       No     16
13      Child      Yes      9
9      Infant      Yes     31
12     Infant       No     13
7         Old       No     42
10        Old      Yes     22
5        Teen       No     56
8        Teen      Yes     39
2     Unknown       No    127
6     Unknown      Yes     52

In [44]:
df.groupby('AgeGroup')['Survived'].value_counts().to_frame()

                    count
AgeGroup  Survived
Adult     No          137
          Yes         102
BabyAdult No          158
          Yes          87
Child     No           16
          Yes           9
Infant    Yes          31
          No           13
Old       No           42
          Yes          22
Teen      No           56
          Yes          39
Unknown   No          127
          Yes          52

In [ ]:
# univariate analysis
# bivariate analysis
# handle the missing values in age column and cabin column

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  AgeGroup     891 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 90.6+ KB